---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredDiffuse
source: html/1ce6f30d-553f-9f99-3179-14b0ce0c48cf.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredDiffuse Property

The property labeled "Color" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string LayeredDiffuse { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.